Revit 2024 API
BasicFileInfo.IsInProgress Property
 Checks if the file is workshared and is in process of becoming Central.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool IsInProgress { get; }
Visual Basic
Public ReadOnly Property IsInProgress As Boolean
	Get
Visual C++
public:
property bool IsInProgress {
	bool get ();
}
See Also
BasicFileInfo Class
Autodesk.Revit.DB Namespace